{
   "content": [
      {
         "id": 1,
         "name": "CRUD de clientes",
         "about": "Executa um back-end de uma aplicação simples, com operações de CRUD",
         "description": "Desafio do curso de desenvolvedor moderno administrado pela Dev Superior. Trata-se de um projeto que consiste em rodar um back-end de uma aplicação simples, com operações de CRUD na base de dados clientes e tratamento de exceções com respostas personalizadas. O projeto está configurado com ambiente de testes acessando o banco de dados H2 já com seeding, usa o Maven como gerenciador de dependências e o Java como linguagem. Para testes é usado o Postman.",
         "photo_url": "https://raw.githubusercontent.com/Rudersonvf/assets/main/crud3.png",
         "git_link": "https://github.com/Rudersonvf/DesafioCrudClientes",
         "categories": [
            {
               "id": 1,
               "name": "Back-end"
            }
         ]
      },
      {
         "id": 2,
         "name": "Portfólio React",
         "about": "É este site que você está olhando agora!",
         "description": "Trata-se de um portfólio desenvolvido em React com Type Script juntamente com o Vite. A parte de UI/UX foi desenvolvida por mim usando o Figma. Os projetos são adicionados de forma dinâmica a partir de um arquivo json hospedado no GitHub.",
         "photo_url": "https://raw.githubusercontent.com/Rudersonvf/assets/main/port1.png",
         "git_link": "https://github.com/Rudersonvf/portfolio-react",
         "prod_link": "https://rudersonvf.netlify.app",
         "categories": [
            {
               "id": 2,
               "name": "Front-end"
            }
         ]
      },
      {
         "id": 3,
         "name": "DevCep",
         "about": "Site responsivo com consumo da api ViaCep.",
         "description": "Trata-se de um site com design responsivo que consome a api ViaCep. Utiliza Java script para validação dos campos, tratamento de exceções e manipulação de DOM.",
         "photo_url": "https://raw.githubusercontent.com/Rudersonvf/assets/main/devCep.png",
         "git_link": "https://github.com/Rudersonvf/dev-cep",
         "prod_link": "https://rudersonvfDevCep.netlify.app",
         "categories": [
            {
               "id": 2,
               "name": "Front-end"
            }
         ]
      },
      {
         "id": 4,
         "name": "RF Movie",
         "about": "Site responsivo em react com filtragem de uma lista de filmes.",
         "description": "Trata-se de um projeto desenvolvido para fins de estudo e prática. Consiste em uma aplicação desenvolvida em React com Typescriptcom o objetivo de filtrar e ordenar uma lista de filmes de varias formas. Utiliza comunicação entre componentes por meio de eventos e estado global.O layout do projeto foi desenvolvido por mim, utilizando o Figma: https://www.figma.com/file/4BfznMsBXRh8ST4RNDarnZ/RF-Movie?type=design&node-id=0-1&mode=design",
         "photo_url": "https://raw.githubusercontent.com/Rudersonvf/assets/main/rfmovie.jpeg",
         "git_link": "https://github.com/Rudersonvf/rf-movie",
         "prod_link": "https://rudersonvfrfmovie.netlify.app",
         "categories": [
            {
               "id": 2,
               "name": "Front-end"
            }
         ]
      }
   ]
}
  
